{
	"profileImage": "https://firebasestorage.googleapis.com/v0/b/banyatb-resume.appspot.com/o/images%2Fprofile.jpg?alt=media",
	"name": "Banyat Boonkaew",
	"position": "Full Stack Developer",
	"address": "47/4 M.10 Wangsala Thamuang Kanchanaburi 71110",
	"phone": "087-503-8950",
	"email": "banyatb@gmail.com",
	"github": "https://github.com/banyatb",
	"skills": [
		{ "skill": "Javascript", "level": 80 },
		{ "skill": "HTML", "level": 70 },
		{ "skill": "CSS", "level": 60 },
		{ "skill": "PostgreSQL", "level": 60 },
		{ "skill": "Python", "level": 50 },
		{ "skill": "PHP", "level": 60 },
		{ "skill": "Golang", "level": 40 },
		{ "skill": "Git", "level": 60 },
		{ "skill": "Docker", "level": 50 },
		{ "skill": "Firebase", "level": 70 },
		{ "skill": "gCloud API", "level": 50 },
		{ "skill": "Line API", "level": 50 }
	],
	"languages": [
		{ "language": "English", "level": 60 }
	],
	"summary": "Creative Front End Developer offering 4+ years of experience providing strong Javascript Framework included Vue.js and React.js. And improving Back End Skills with Loopback, PostgreSQL and Firebase. I can develop web-based applications in a wide range for customer requirements with new web-based technologies. I am eager to learn new things that can improve skills or productivities in my job.",
	"experience": [
		{
			"duration": "2018-08 - 2021-01",
			"position": "Full Stack Developer",
			"company": "MASSPAKS CONCEPTS COMPANY LIMITED",
			"jobs": [
				"Worked with Top Food Industry Company to create Food Chain Mangement System. Included member, audit, specification and complain system by using Vue.js and Loopback.",
				"Created Logistics Management System to collect all paper bills and excel sheets in one system by using React.js and Firebase."
			]
		},
		{
			"duration": "2017-01 - 2017-09",
			"position": "Front End Developer",
			"company": "Witsawa Corporation Co., Ltd",
			"jobs": [
				"Developed web app for Online Learning Management System by using Vue.js."
			]
		},
		{
			"duration": "2010-01 - 2017-01",
			"position": "Web Developer",
			"company": "Freelance",
			"jobs": [
				"Created website using Wordpress by followed Search Engine Optimization Instruction.",
				"Customized Wordpress Themes.",
				"Edited Wordpress Plugin.",
				"Installed Wordpress on unmanaged server by using LEMP Stack and following security vulnerabilities."
			]
		}
	],
	"education": [
		{
			"duration": "2000-06 - 2004-05",
			"degree": "Bachelor of Material Engineering",
			"school": "Kasetsart University"
		}
	],
	"achievements": [
		"Collect all specification papers into online system that advantage to searching, classifying, updating, alerting.",
		"Reduce time to fill data from pdf file by using Google Vision API to convert pdf to text and record some data in the system.",
		"Reduce time to develop for pdf generator by using docx template. Customer can edit and upload to server by themselves."
	],
	"interests": [
		"UX, I am interested in learning UX due to I wish to provide meaningful and relevant experiences to users. I am one of the volunteers in UX Thailand Community.",
		"Financial, I have learnt everything about the financial knowledge since graduation. And I have applied development knowledge to create automatically trading bot for crypto currency by using Python, Tradingview (Pine script) and Firebase.",
		"Mobile App, I am learning Flutter to create mobile app.",
		"Line API, I try to use Line API with side projects.",
		"Running, I achieved my goal for SUB1 in Mini Marathon and SUB2 in Half Marathon."
	]
}
